web/app/controllers/favorites_controller.rb

INSERT INTO `favorites` (`users_id`, `parkings_id`, `created_at`, `updated_at`) VALUES (1, 22, '2016-07-26 02:36:53', '2016-07-26 02:36:53')
---
  def create
    @favorite = Favorite.new({users_id: params[:userId], parkings_id: params[:parkingId]})
    @favorite.save