web/app/controllers/parkings_controller.rb

    def show
        @parking = Parking.find(params[:id])
---
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 2 LIMIT 1

    def edit
        @parking = Parking.find(params[:id])
---
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 1 LIMIT 1

    def update
        @parking = Parking.find(params[:id])
        if @parking.update_attributes(parking_params)
---
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 2 LIMIT 1
UPDATE `parkings` SET `titulo` = 'Alquiler de Cocheras,', `descripcion` = 'EN EDIFICIO DE OFICINAS, PARA AUTO O CAMIONETA ALQUILO ESTACIONAMIENTO EN ESQ. DE SHELL CON LARCO MIRAFLORES (AL FRENTE DEL BCP), EN SOTANO CON SERVICIO DE ASCENSOR. ATENCION: SOLAMENTE PARA PERSONAS QUE TENGAN OFICINA CERCANA O TRABAJEN EN LA ZONA. ALQUILER 24 HORAS. HORARIO DE INGRESO Y SALIDA DE COCHERAS: DESDE LAS 6:30 AM HASTA LAS 10:30 PM. DE L A Sáb. Y D. HASTA EL 1/2 DIA. S/200.00 POR MES. MINIMO DESDE (6) MESES. 1X1. 1 MES DE DEPOSITO Y 1 MES DE ADELANTO COPIA DE DNI Y TARJETA DE PROPIEDAD. CONTACTAR ', `updated_at` = '2016-07-18 20:55:05' WHERE `parkings`.`id` = 2

    def destroy
        Parking.find(params[:id]).destroy
---
DELETE FROM `parkings` WHERE `parkings`.`id` = 1
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 1 LIMIT 1

    def create
        @parking = Parking.new(parking_params)
        if @parking.save
---
INSERT INTO `parkings` (`titulo`, `descripcion`, `created_at`, `updated_at`) VALUES ('titulo', 'descripcion', '2016-07-18 19:46:19', '2016-07-18 19:46:19')