web/app/views/home/account.html.erb

        <a href="javascript:;" data-id="account-parkings" class="list-group-item ">
          <span class="badge" id="parking-cant"><%= @parking.size %></span>
---
SELECT COUNT(*) FROM `parkings`
SELECT `parkings`.* FROM `parkings`